# Preparing baby name data
Extracting raw name data from US, UK and Irish stats files to create three csv files with [name, sex, births, year]

US: https://www.ssa.gov/oact/babynames/background.html    
UK: https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/livebirths    
Ireland: https://www.cso.ie/px/pxeirestat/Database/eirestat/Irish%20Babies%20Names/Irish%20Babies%20Names_statbank.asp?SP=Irish%20Babies%20Names&Planguage=0

In [5]:
import pandas as pd
import numpy as np

## US Baby Names

In [2]:
years = range(1880, 2024)  # this needs updating if data changes
pieces = []
columns = ['name', 'sex', 'births']
for year in years:
    path = 'usbabynames/yob%d.txt' % year
    frame = pd.read_csv(path, names=columns)
    frame['year'] = year
    pieces.append(frame)
# Concatenate everything into a single DataFrame
usnames = pd.concat(pieces, ignore_index=True)

In [3]:
usnames.head()

        name sex  births  year
0       Mary   F    7065  1880
1       Anna   F    2604  1880
2       Emma   F    2003  1880
3  Elizabeth   F    1939  1880
4     Minnie   F    1746  1880

In [4]:
usnames.tail()

           name sex  births  year
1924660   Zykai   M       5  2017
1924661  Zykeem   M       5  2017
1924662   Zylin   M       5  2017
1924663   Zylis   M       5  2017
1924664   Zyrie   M       5  2017

In [5]:
usnames.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1924665 entries, 0 to 1924664
Data columns (total 4 columns):
name      object
sex       object
births    int64
year      int64
dtypes: int64(2), object(2)
memory usage: 73.4+ MB

In [6]:
usnames.describe()

               births            year
count  1924665.000000  1924665.000000
mean       180.873304     1974.850994
std       1533.337250       34.029480
min          5.000000     1880.000000
25%          7.000000     1951.000000
50%         12.000000     1985.000000
75%         32.000000     2003.000000
max      99686.000000     2017.000000

In [7]:
usnames.to_csv('usnames.csv', index=False)

## UK Baby Names
Got from https://raw.githubusercontent.com/leeper/ukbabynames/master/data-raw/ukbabynames.csv rather than munging the original xls

In [8]:
df = pd.read_csv("https://raw.githubusercontent.com/leeper/ukbabynames/master/data-raw/ukbabynames.csv")

In [9]:
df.head()

   year sex     name     n  rank
0  1996   F   Sophie  7087     1
1  1996   F    Chloe  6824     2
2  1996   F  Jessica  6711     3
3  1996   F    Emily  6415     4
4  1996   F   Lauren  6299     5

In [10]:
df = df.rename(index=str, columns={'n':'births'}).drop(['rank'], axis=1)

In [11]:
df = df[['name', 'sex', 'births', 'year']]

In [12]:
df.head()

      name sex  births  year
0   Sophie   F    7087  1996
1    Chloe   F    6824  1996
2  Jessica   F    6711  1996
3    Emily   F    6415  1996
4   Lauren   F    6299  1996

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 227449 entries, 0 to 227448
Data columns (total 4 columns):
name      227449 non-null object
sex       227449 non-null object
births    227449 non-null int64
year      227449 non-null int64
dtypes: int64(2), object(2)
memory usage: 8.7+ MB

In [14]:
df = df[df.births != 0]

In [15]:
df.tail()

            name sex  births  year
227444     Zohan   M       3  2015
227445      Zora   M       3  2015
227446    Zubeyr   M       3  2015
227447  Zulfiqar   M       3  2015
227448     Zylus   M       3  2015

In [16]:
df.describe()

              births           year
count  227449.000000  227449.000000
mean       54.280397    2006.472462
std       321.296742       5.644970
min         3.000000    1996.000000
25%         4.000000    2002.000000
50%         6.000000    2007.000000
75%        15.000000    2011.000000
max     10779.000000    2015.000000

In [17]:
df.to_csv("uknames.csv", index=False)

## Irish Baby Names

In [18]:
irish = pd.read_csv("irishnames.csv")  # complicated so created in another place

In [19]:
irish.head()

    name sex  births  year
0  Emily   F     178  1998
1  Emily   F     285  1999
2  Emily   F     262  2000
3  Emily   F     287  2001
4  Emily   F     278  2002

In [20]:
irish.describe()

            births         year
count  5798.000000  5798.000000
mean    147.873577  2007.234736
std     152.115701     5.666414
min       3.000000  1998.000000
25%      48.000000  2002.000000
50%      89.000000  2007.000000
75%     191.000000  2012.000000
max    1151.000000  2017.000000

In [21]:
irish.tail()

       name sex  births  year
5793  Ollie   M     179  2017
5794   Luca   M      78  2014
5795   Luca   M      71  2015
5796   Luca   M      77  2016
5797   Luca   M       6  2017

## French Baby Names

Original data from https://catalogue-donnees.insee.fr/en/catalogue/recherche/DS_PRENOMS 

Tidied by https://www.kaggle.com/datasets/haezer/french-baby-names

In [7]:
french = pd.read_csv("frenchnames.csv")

In [9]:
french.head()

   year      name sex  count
0  1900   Abeline   F      3
1  1900    Abelle   F      3
2  1900       Ada   F      4
3  1900  Adelaide   F    194
4  1900     Adèle   F    661

In [11]:
french.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 601223 entries, 0 to 601222
Data columns (total 4 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   year    601223 non-null  int64
 1   name    601223 non-null  object
 2   sex     601223 non-null  object
 3   count   601223 non-null  int64
dtypes: int64(2), object(2)
memory usage: 18.3+ MB

In [13]:
french.describe()

                year          count
count  601223.000000  601223.000000
mean     1981.647710     137.663270
std        31.230507     909.408928
min      1900.000000       3.000000
25%      1964.000000       4.000000
50%      1991.000000       8.000000
75%      2007.000000      24.000000
max      2018.000000   53706.000000

In [15]:
french.tail()

        year     name sex  count
601218  2018  Zoumana   M      8
601219  2018     Zyad   M     71
601220  2018     Zyan   M     17
601221  2018    Zyane   M      8
601222  2018     Zyed   M     43